app/controllers/wods_controller.rb

  def index
    @wods = Wod.all
---
SELECT "wods".* FROM "wods"

  def display

    @wods = Wod.where("DATE(date) = ? " ,Date.today  )
    logger.debug "Entries on Wods table #{@wods.first}"
    @wod = @wods.first
    if !@wod
      @wods = Feed.where("DATE(date) = ? " ,Date.today  )
---
SELECT  "wods".* FROM "wods"  WHERE (DATE(date) = '2015-11-16' )  ORDER BY "wods"."id" ASC LIMIT 1
SELECT  "feeds".* FROM "feeds"  WHERE (DATE(date) = '2015-11-16' )  ORDER BY "feeds"."id" ASC LIMIT 1

  def create
    @wod = Wod.new(wod_params)

    respond_to do |format|
      if @wod.save
---
INSERT INTO "wods" ("created_at", "date", "meaning", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-11-16 09:51:17.319834"], ["date", "2015-11-16"], ["meaning", "Backbone of India"], ["title", "Farmer"], ["updated_at", "2015-11-16 09:51:17.319834"]]

  def destroy
    @wod.destroy
---
DELETE FROM "wods" WHERE "wods"."id" = ?  [["id", 2]]

    def set_wod
      @wod = Wod.find(params[:id])
---
SELECT  "wods".* FROM "wods"  WHERE "wods"."id" = ? LIMIT 1  [["id", 2]]